# Pandas Basics

- part I
    - data import
    - dataframes and series
    - operations on series
    - filtering: columns
    - filtering: rows
    - exercises
- part II
    - merge, join, groupby

# Data Import

In [4]:
%pip install pandas

Collecting pandas
  Downloading pandas-1.5.3-cp311-cp311-macosx_11_0_arm64.whl (10.8 MB)
     |████████████████████████████████| 10.8 MB 4.9 MB/s eta 0:00:01
Collecting numpy>=1.21.0
  Downloading numpy-1.24.2-cp311-cp311-macosx_11_0_arm64.whl (13.8 MB)
     |████████████████████████████████| 13.8 MB 16.3 MB/s eta 0:00:01
Collecting pytz>=2020.1
  Downloading pytz-2022.7.1-py2.py3-none-any.whl (499 kB)
     |████████████████████████████████| 499 kB 15.1 MB/s eta 0:00:01
Requirement already satisfied: python-dateutil>=2.8.1 in /Users/daniel_david_kovacs/.pyenv/versions/3.11.0a6/lib/python3.11/site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in /Users/daniel_david_kovacs/.pyenv/versions/3.11.0a6/lib/python3.11/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: pytz, numpy, pandas
Successfully installed numpy-1.24.2 pandas-1.5.3 pytz-2022.7.1
WARNING: You are using pip version 21.2.4; however, version 23.0.1 is available.
You should consider upgrading via the '/Users/daniel_david_kovacs/.pyenv/versions/3.11.0a6/bin/python -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [1]:
import os
import re
from typing import List

def source_path(file_pattern: str) -> List[str]:
    dir = os.path.join(
        # os.path.dirname(__file__),
        os.path.pardir,
        'datasets',
        'imdb_full'
    )
    source_files = [
        os.path.abspath(os.path.join(dir, f)) 
        for f 
        in os.listdir(dir) 
        if re.match(file_pattern, f)]
    return source_files

In [2]:
import pandas as pd

with open(source_path(r"movies_.*\.csv")[0]) as movies:
    movies_df = pd.read_csv(movies)

movies_df

      movieid                          title  year
0     1672052        'Breaker' Morant (1980)  1980
1     1672111   'Crocodile' Dundee II (1988)  1988
2     1672580      'Til There Was You (1997)  1997
3     1672716          'night, Mother (1986)  1986
4     1672946  ...And Justice for All (2014)  2014
...       ...                            ...   ...
3827  2591814                eXistenZ (1999)  1999
3828  2592334          ¡Three Amigos! (1986)  1986
3829  2592963       À nous la liberté (1931)  1931
3830  2593112          Á köldum klaka (1995)  1995
3831  2593313                  Átame! (1990)  1990

[3832 rows x 3 columns]

In [17]:
with open(source_path(r"actors_.*\.csv")[0]) as actors:
    actors_df = pd.read_csv(actors)

actors_df

       actorid                   name sex
0            4             $hort, Too   M
1           16     'Bear'Boyd, Steven   M
2           28   'Dead End' Kids, The   M
3          566         Aaby, Kristian   M
4          580                  Aadil   M
...        ...                    ...  ..
98685  2749162          Ôshima, Akiyo   F
98686  2749168         Ôshima, Yukari   F
98687  2749204            Ôtani, Ikue   F
98688  2749377  Örnólfsdóttir, Álfrún   F
98689  2749386             Öss, Eniko   F

[98690 rows x 3 columns]

In [18]:
with open(source_path(r"movies2actors_.*\.csv")[0]) as movies_actors:
    movies_actors_df = pd.read_csv(movies_actors)

movies_actors_df

        movieid  actorid                       as_character  leading
0       1672052    88796             [Court reporter]  <20>       20
1       1672052    88848  [Col. Ian 'Johnny' Hamilton]  <7>        7
2       1672052   121878                   [Lt. Reed]  <21>       21
3       1672052   134348                 [Large Boer]  <41>       41
4       1672052   198682          [Lt. Peter Handcock]  <4>        4
...         ...      ...                                ...      ...
138344  2593313  2439175            [Camello en Vespa]  <6>        6
138345  2593313  2486754               [Farmacéutica]  <12>       12
138346  2593313  2521993                  [Periodista]  <9>        9
138347  2593313  2568546                        [Alma]  <4>        4
138348  2593313  2633550                    [Camello]  <24>       24

[138349 rows x 4 columns]

In [47]:
with open(source_path(r"ratings_.*\.csv")[0]) as ratings:
    ratings_df = pd.read_csv(ratings)

ratings_df

      movieid  rank    votes distribution
0     1672052   7.8   8111.0   0000001222
1     1672111   5.3  32183.0   0001221000
2     1672580   4.4   1894.0   0011110000
3     1672716   7.0   1255.0   0000001212
4     1673647   6.5    128.0   0000111211
...       ...   ...      ...          ...
3768  2591814   6.8  56563.0   0000012210
3769  2592334   6.2  36951.0   0000122100
3770  2592963   7.6   2294.0   0000002311
3771  2593112   6.9   1231.0   0000012211
3772  2593313   6.9  12087.0   0000013210

[3773 rows x 4 columns]

# DataFrames
like tables, has two dimensions: columns - with names, and rows.

In [46]:
print("--- DataFrame ---")
df = pd.DataFrame({"column A": [1, 2, 3], "column B": ['a', 'b', 'c']})
print("NB! Leave df-s as last statement in notebook cell, gets pretty printed."
      "Python print(...) is less pretty. Observe:\n")
print(df)
print("\n--- vs. ---\n")
df

--- DataFrame ---
NB! Leave df-s as last statement in notebook cell, gets pretty printed.Python print(...) is less pretty. Observe:

   column A column B
0         1        a
1         2        b
2         3        c

--- vs. ---

   column A column B
0         1        a
1         2        b
2         3        c

In [17]:
print("type of DataFrame object: ", type(df))

type of DataFrame object:  <class 'pandas.core.frame.DataFrame'>

## Index
DataFrames can have indices. Single, or multi level.

Default index (above) is a 0-based range, with no name. Index can be
- renamed
- set to a different column
- opt to keep or discard existing index, when adding a new one.

Index can also be converted into regular columns.

In [12]:
# rename index
df.index.rename("my_index", inplace=True)
df

          column A column B
my_index
0                1        a
1                2        b
2                3        c

In [13]:
# add another column:
df["blip"] = ["blup", "blup", "blargh"]
df

          column A column B    blip
my_index
0                1        a    blup
1                2        b    blup
2                3        c  blargh

In [15]:
df.set_index("blip", append=True, inplace=True)
df

                 column A column B
my_index blip
0        blup           1        a
1        blup           2        b
2        blargh         3        c

In [16]:
# turn index into column
df.reset_index(level=0, inplace=True)
df

        my_index  column A column B
blip
blup           0         1        a
blup           1         2        b
blargh         2         3        c

## set - reset
- SET turns column into index
- RESET turns index into column

# Series
Series is like a single column of a DataFrame, a sequence.

NB! Sequence can also be indexed.

In [21]:
print(' --- Series --- ')
s = df['column B']  # select column of a dataframe
s

 --- Series ---

blip
blup      a
blup      b
blargh    c
Name: column B, dtype: object

NB! Series don't pretty print, like DataFrames :(

In [35]:
print("Type of series object: ", type(s))

Type of series object:  <class 'pandas.core.series.Series'>

In [36]:
print("Index of a series: ")
s.index

Index of a series:

Index(['blup', 'blup', 'blargh'], dtype='object', name='blip')

## Broadcasting
One of the powers of Pandas is that an operation between a series and a scalar is understood as: perform operation elementwise:

In [30]:
print("numeric series to play with: df['column A']")
num_series = df['column A']
num_series

numeric series to play with: df['column A']

blip
blup      1
blup      2
blargh    3
Name: column A, dtype: int64

In [32]:
print("multiply series: num_series * 10")
num_series * 10

multiply series: num_series * 10

blip
blup      10
blup      20
blargh    30
Name: column A, dtype: int64

In [29]:
print("boolean operations: num_series > 2")
num_series > 2

boolean operations:

blip
blup      False
blup      False
blargh     True
Name: column A, dtype: bool

## String Functions
broadcasting string functions are namespaced under `.str`, like:
- upper()
- lower()
- endswith()
- startswith()
- contains()
- ...

In [51]:
str_series = df['column B']
str_series

0    a
1    b
2    c
Name: column B, dtype: object

In [34]:
print('.str namespace functions:')
str_series.str.upper()

.str namespace functions:

blip
blup      A
blup      B
blargh    C
Name: column B, dtype: object

**NB!** similar namespacing exists for date functions: `pandas.Series.dt`

# Filtering DataFrames
square bracket notation fetches a series from a dataframe. Pass a 
- single column name to get a series from one column
- a list of columns to get a new dataframe with only the specified columns
- a list of booleans to filter row-wise
    - True keeps the row
    - False drops the row

## Columns of DataFrame
Specify multiple column names as a list in dataframe index

In [47]:
df['Column C'] = df['Column C'].str.upper() + "_" + df['column A'].astype(str)
df

   column A column B Column C
0         1        a      A_1
1         2        b      B_2
2         3        c      C_3

In [52]:
# only column B and C
df[["column B", "Column C"]]

  column B Column C
0        a      A_1
1        b      B_2
2        c      C_3

## Rows of DataFrames
Filter rows with a sequence of bools acting as a mask

In [53]:
# lets keep the first and third row only
df[[True, False, True]]

   column A column B Column C
0         1        a      A_1
2         3        c      C_3

It would be of little use, if the bool list had to be created by hand. Remember the broadcasting operations on series, that produce bools?

In [54]:
print("True for odd, False for even numbers: ")
df['column A'] % 2 == 1

True for odd, False for even numbers:

0     True
1    False
2     True
Name: column A, dtype: bool

And now combining the two:

In [55]:
df[df['column A'] % 2 == 1]

   column A column B Column C
0         1        a      A_1
2         3        c      C_3

# Exercise I.
## How many movies in dataframe?

In [19]:
print("Total number of movies: ", len(movies_df))

3832

## What are the earliest two films?

In [28]:
movies_df.sort_values('year').head(2)

                                       title  year
movieid
2452309                    The Lodger (1898)  1898
1677472  20,000 Leagues Under the Sea (1905)  1905

## How many movies have the title "Hamlet"?

In [30]:
hamlets = movies_df[movies_df['title'].str.contains("Hamlet")]
print("Number of movies with 'Hamlet' in the title: ", len(hamlets))

Number of movies with 'Hamlet' in the title:  5

## When was the first movie titled "Hamlet" made?

In [35]:
hamlets.sort_values('year').head(1)

                 title  year
movieid
1984751  Hamlet (1907)  1907

## Number of movies made in 1981

In [39]:
movies_81 = movies_df[movies_df["year"] == 1981].sort_values('year')
print("Number of movies made in '81: ", len(movies_81))

Number of movies made in '81:  43

## Number of movies made between 1990 and 1995

In [41]:
movies_90_95 = movies_df[(movies_df['year'] >= 1990) & (movies_df['year'] <= 1995)]
print("Number of movies made '90–'95: ", len(movies_90_95))

Number of movies made '90–'95:  949

## How many movie rankings without votes?

In [52]:
ratings_df[ratings_df['votes'].isna()]

      movieid  rank  votes distribution
22    1682630   8.1    NaN          NaN
2291  2281612   4.4    NaN          NaN

## Display the roles, in leading order, of the 1972 film "Solyaris".

In [68]:
# get movie id
solaris_id = movies_df[movies_df['title'] == "Solyaris (1972)"].index.values[0]
# find all the roles in solaris
# NB! output is a series, not a table
movies_actors_df[movies_actors_df['movieid'] == solaris_id].set_index('leading').sort_index()['as_character']
# todo! merge the two tables

leading
1                                           [Hari]  <1>
2                                    [Kris Kelvin]  <2>
3                                      [Dr. Snaut]  <3>
4                                   [Henri Berton]  <4>
5                                [Kelvin's Father]  <5>
6                                  [Dr. Sartorius]  <6>
7           (as O. Barnet)  [Kris Kelvin's Mother]  <7>
8           (as V. Kerdimun)  [André Berton's son]  <8>
9         (as O. Kizilova)  [Gibarian's she-guest]  <9>
10                          [Kris Kelvin's niece]  <10>
11    (as A. Misharin)  [Shannahan, Berton's expedit...
12          (as B. Oganesyan)  [Professor Trajet]  <12>
13                     [Anna, Kris Kelvin's aunt]  <13>
14    (as S. Sarkisyan)  [Dr. Gibarian, a physiologi...
15    (as Yu. Semyonov)  [Chairman of Investigation ...
16            [Kris Kelvin in his early teen-age]  <16>
17                               (as V. Sumenova)  <17>
18           (as G. Tejkh)  [Professor Messenger]  <18>
Name: as_character, dtype: object